Repository: NoopikxD/PromtTest
Catalog: CorpusSearch/CorpusSearch/en-ru.tmx
Source language: en
Languages: ru

source: The beauty of all beauties, the unrivaled Princess Boudour, honors the baths with her presence!
ru: Скорей, чужеземец! красавица красавиц, несравненная царевна Будур изволит отправиться в баню!

source: Any who dares to look upon the Princess shall lose his head!
ru: кто посмотрит на царевну, тому отрубят голову!

source: I don' t want to!
ru: Не хочу!

source: I don' t want to bathe!
ru: Не хочу мыться!

source: - I don' t want to!
ru: - Не хочу!

source: - What do you want, then?
ru: - А что же ты хочешь?

source: I want him to look upon me.
ru: Пусть он на меня посмотрит.

source: - Then he' il have his head cut off.
ru: - Но ему же отрубят голову.

source: - So what?
ru: - Ну и что?

source: Mustafa!
ru: Мустафа!

source: - Young man, open your eyes!
ru: - Юноша, открой глаза!

source: - Come on, and you' il have no head.
ru: - Открой, останешься без головы.

source: I wish that a wild lion would pounce on you, so that I could kill him.
ru: Я хочу, чтобы на тебя напал лев, и я его убью.

source: I wish that a fire would engulf all Bagdad and I' d rescue you.
ru: Чтобы загорелся весь Багдад, и я бы вынес тебя из огня.

source: leaving only two of us, you and me.
ru: И чтобы землетрясение, и чтобы все провалились, и остались только ты и я.

source: - What name were you given?
ru: - как тебя зовут?

source: - Aladdin, son of Ali Al Marouf.
ru: - Аладдин, сын Али Аль- Маруфа.

source: - You can' t take the Princess' hand.
ru: - Царевну нельзя брать за руку.

source: - I' ve already done so.
ru: - А я уже взял.

source: Cut off his head anyway...
ru: Все равно отрубите ему голову...

source: Strike the blow!
ru: Руби!

source: Catch him, dead or alive!
ru: Найти его живым или мертвым!

source: I held the hand of the Sultan' s daughter, Boudour!
ru: Я держал за руку царевну Будур!

source: You must ask the Sultan for his daughter' s hand.
ru: Сейчас ты пойдешь свататься к султану.

source: And yesterday he said he was flying on dragons.
ru: А вчера он сказал, что летал на драконе.

source: ls this not the dwelling of the Chosen One and the King of Luck, Aladdin?
ru: Не здесь ли живет избранник счастья и хан удачи Аладдин?

source: Aladdin is my son.
ru: Аладдин - мой сын.

source: Here are presents for you from your uncle!
ru: Это посылает тебе твой дядя!

source: I didn' t know my husband was blessed with a brother.
ru: Я не знала, что у моего Али был брат.

source: ls this not the house of Aladdin, son of Ali Al Marouf?
ru: Не здесь ли живет Аладдин, сын Али Аль- Маруфа?

source: - From my uncle?
ru: - От дяди?

source: - Your uncle.
ru: - От дяди.

source: They must have made a mistake.
ru: Они перепутали.

source: They' il come and take it all back.
ru: Сейчас за этим вернутся.

source: Where is my brother?
ru: Где мой брат?

source: Where' s my brother, Ali Al Marouf?
ru: Где мой брат Али Аль- Маруф?

source: Ali Al Marouf has been dead for three years.
ru: Али Аль- Маруф умер три года назад.

source: I was his best friend.
ru: Я был его лучшим другом.

source: Oh, my miserable brother!
ru: О, несчастный мой брат!

source: Oh, how cruel and bitter my fate!
ru: О, горька и жестока моя судьба!

source: Forty years have I wandered over the earth!
ru: Сорок лет я скитался по свету!

source: I dreamed of coming back and embracing my brother!
ru: Я думал о том, как вернусь домой, обниму брата!

source: But my Ali didn' t have any brother.
ru: Но у моего Али не было брата.

source: Believing me dead he couldn' t bear to mention my name.
ru: Он думал, что я умер и никогда меня не вспоминал.

source: Where is the place the deceased loved most?
ru: Где было любимое место покойного?

source: - Where' s my nephew Aladdin?
ru: - Где мой племянник Аладдин?

source: - There!
ru: - Вот!

source: My cherished nephew, tell me your innermost desire.
ru: Мой возлюбленный племянник, скажи мне свое самое сокровенное желание.

source: I shall grant it.
ru: Я исполню его.

source: He will ask you for a star from the heavens.
ru: Он попросит луну с неба.

source: He has just wanted me to ask for Princess Boudour' s hand!
ru: Только что он посылал меня сватать царевну Будур!

source: - Could he be possessed by genies?
ru: - Может, в него вселились джины?

source: - I will cure him.
ru: - Я его вылечу.

source: Leave us now!
ru: Оставь нас!

source: For 40 years I have studied alchemy and black magic with the wisest men of all Maghrib.
ru: Знай, сорок лет я обучался алхимии и волшебству у лучших магов Магриба.

source: Forty years have I dedicated to the preparation of magic powders that' d open the gates of dungeons and reveal the darkest secrets.
ru: Сорок лет я потратил на то, чтобы сделать волшебные порошки, открывающие двери темниц и дурманящие разум.

source: Put your trust in me.
ru: Доверься мне.

source: I will help you.
ru: Я тебе помогу.

source: - Where are we going, Uncle?
ru: - Мы куда, дядя?

source: - To an enchanted city.
ru: - В заколдованный город.

source: You alone will penetrate a place from which no one' s ever returned.
ru: Тебе одному суждено проникнуть туда, откуда никто не возвращался.

source: There you' il find an old bronze lamp.
ru: Там хранится старая медная лампа.

source: Repeat it!
ru: Повтори!

source: An old bronze lamp...
ru: Старая медная лампа...

source: You will bring it to me and all your wishes will be granted.
ru: Ты принесешь ее мне, и твои желания исполнятся.

source: Go now!
ru: Иди!

source: The entrance is there!
ru: Вход здесь!

source: You' il get in the shadow of the city and in the city of shadows.
ru: Ты попадешь в тень города и в город теней...

source: - Who is there?
ru: кто тут? - кто тут? - кто тут? кто тут?

source: Who sneezed?
ru: кто чихнул?

source: Show yourself!
ru: Выходи!

source: Why have you come here?
ru: Зачем ты пришел?

source: I came to find the lamp!
ru: Я пришел за лампой!

source: Amazing!
ru: Удивительно!

source: lncredible!
ru: Невероятно!

source: He said the truth!
ru: Сказал правду!

source: I must have the lamp and I' ve just told you so.
ru: Мне нужна лампа, и я про это сказал.

source: - What shall we do?
ru: - Что делать?

source: Where are you hiding?
ru: куда вы все подевались?

source: You' re disturbing our meditation!
ru: Не мешай нам думать!

source: Take the lamp.
ru: Возьми лампу.

source: It is yours.
ru: Она твоя.

source: Where will I find it?
ru: А где она?

source: Show him the way.
ru: Покажи ему дорогу.

source: This way.
ru: Сюда.

source: This way!
ru: Сюда!

source: ls this it?
ru: Эта?

source: - What are you doing, Uncle?
ru: - Что ты делаешь, дядя?!

source: - Uncle?!
ru: - Дядя?!

source: Come back at once!
ru: Скорее вернись!

source: Aladdin, I was only joking!
ru: Аладдин, я пошутил!

source: Aladdin!
ru: Аладдин!

source: I hear and obey!
ru: Слушаю и повинуюсь!

source: I' m this lamp' s slave.
ru: Я раб этой лампы.

source: I' m at your command!
ru: Приказывай!

source: - Are you a Genie?
ru: - Ты джин?

source: Why did my uncle want to kill me?
ru: Почему дядя хотел меня убить?

source: He is not your uncle.
ru: Он не дядя.

source: He' s an evil Maghribian sorcerer.
ru: Он злой магрибский колдун.

source: We Genies have long known him.
ru: Мы, джины, давно его знаем.

source: I' m yours to command!
ru: Приказывай!

source: To do what?
ru: Что?

source: What you will.
ru: Ну как что?

source: Strangle him?
ru: Удавить его?

source: Drown him?
ru: Утопить?

source: Reduce him to dust?
ru: Стереть в порошок?.

source: Let him go to all four corners of the earth.
ru: Пусть уходит на все четыре стороны.

source: To all four corners of the earth?
ru: На четыре стороны?

source: We don' t want to!
ru: Мы не хотим!

source: The blessings of Allah be upon you!
ru: Да будет с тобой милость Аллаха!

source: Wake up!
ru: Вставай!

source: It' s time to bake cakes.
ru: Пора печь пирожки.

source: Allah has granted us another fine day.
ru: Аллах подарил нам сегодня хороший день.

source: I wish I had a skewer of shish kebab!
ru: Сейчас бы палочку шашлыка!

source: - I didn' t know you were a joker!
ru: - Я не знала, что ты шутник!

source: - You play little jokes, too.
ru: - Сама ты шутница.

source: Who started the fire?
ru: кто разжег печь?

source: I didn' t know you could make cakes.
ru: Я не знала, что ты умеешь делать пирожки.

source: I' m eighty five, but never have I made a single cake.
ru: Я прожил 85 лет, но ни разу в жизни не делал пирожков.

source: - Have a cake!
ru: - Возьми пирожок!

source: - Genies never eat cakes.
ru: - Джины не едят пирожки.

source: - What do Genies eat, then?
ru: - А что едят джины?

source: - Nothing at all.
ru: - Ничего не едят.

source: I' d like you to meet my friend the Genie.
ru: Это мой друг джин.

source: I' d rather stay in the lamp.
ru: Я лучше побуду в лампе.

source: I knew that all that reading would end up badly.
ru: Я знала, что эти сказки не доведут его до добра.

source: Remember, I haven' t seen anything.
ru: Я ничего не видел.

source: You haven' t seen anything either.
ru: Я тебе скажу больше - и ты тоже ничего не видела.

source: Neither of us have seen anything.
ru: Мы оба ничего не видели.

source: Do you know why I have lived to be 85?
ru: Знаешь, почему я прожил 85 лет?

source: Because all life I' ve been saying:
ru: Потому что все время говорил:

source: "All is quiet in Bagdad!"
ru: "В Багдаде все спокойно!"

source: To live to be 100 years old, you must learn to be virtuous.
ru: Чтобы дожить до ста лет, изучай добродетель.

source: The basis for all good is in holding the spirit in check, in humility and in piety, and above all in chastity, in patience and modesty.
ru: Ибо основа всякого блага в обуздании души и смирении, и набожности, и невинности, и терпеливости, и стыдливости.

source: Each of us must know when to give proof of our modesty and when to show impertinence.
ru: каждому следует знать, когда нужна стыдливость, а когда бесстыдство.

source: And to act so as to be permanently exploring good.
ru: И поступать так, чтобы приблизиться к благу.

source: Because the state of perfection is modesty, and the state of evil is another kind of modesty.
ru: Ибо сказано, предпосылка блага - стыд, а предпосылка зла - тоже стыд.

source: Will you come out for a second?
ru: Выйди- ка на минутку.

source: - Are you listening to me?
ru: - Ты меня слушаешь?

source: Guards!
ru: Стража!

source: Don' t be afraid!
ru: Не бойся!

source: - Who am l?
ru: - Я кто?

source: - And who are you?
ru: - Это ты кто?

source: - But who are you?
ru: - Вот ты кто?

source: - Princess Boudour.
ru: - Царевна Будур. - кто?

source: - The Princess Boudour.
ru: - Царевна Будур.

source: - Who' s that mumbling there?
ru: - Этого еще не хватало. - кто там бормочет?

source: Where' s that voice coming from?
ru: Откуда все взялось?

source: It' s a loafer who' s listened to too many silly stories.
ru: Один бездельник наслушался глупых сказок.

source: Come here!
ru: Иди сюда!

source: - Ajar.
ru: - Горшок.

source: - And what' s that?
ru: - А это что?

source: - That?
ru: - Это?

source: - An oven!
ru: - Печь!

source: - An oven...
ru: - Печь...

source: For baking meat cakes.
ru: Где пекут пирожки.

source: - You understand?
ru: - Поняла?

source: What is this mysterious monster?
ru: А это что за невиданное чудовище?

source: - It' s a goat, not a monster.
ru: - Это не чудовище, это коза!

source: - Does it make the cheese?
ru: - Из которой сыр?

source: - I' m sixteen.
ru: - Шестнадцать!

source: I already knew what a goat is when I was three years old.
ru: когда мне было три года, я уже знала, что такое коза.

source: They' re looking for someone.
ru: кого- то ищут.

source: Perhaps for the Bagdad thief.
ru: Может, в наш город вернулся багдадский вор?

source: They' re not looking forjust one, but for forty of them.
ru: Тут не одного ищут, а целых сорок!

source: - Ah, it' s you?
ru: - А, это ты?

source: - Yes, it' s me.
ru: - Я.

source: Why are you laughing?
ru: Что ты смеешься?

source: I know what you' re going to ask me.
ru: Я знаю, что ты хочешь сказать мне.

source: I' ve already been asked by 1 7 princes.
ru: Это мне говорили 1 7 принцев.

source: Poor princes.
ru: Бедненькие.

source: I refused them all.
ru: Я им всем отказала.

source: Then it' s "no"?
ru: Значит, нет?

source: Go to my father and ask for my hand.
ru: Пойди к моему отцу, посватай меня.

source: And will you say "yes"?
ru: И ты скажешь "да"?

source: How should I know what I' il say?
ru: Откуда я знаю, что я скажу!

source: I' il say whatever comes to my head!
ru: Что придет в голову, то и скажу!

source: The Princess is here!
ru: Царевна здесь!

source: That' s you again!
ru: Опять ты!

source: - Tie him up!
ru: - Вяжите его!

source: Tie him!
ru: Связать!

source: I hope Princess Boudour will forgive me!
ru: Да простит меня царевна Будур.

source: My Sultan, he' s the one who dared gaze on the Princess twice.
ru: Вот кто осмелился дважды увидеть царевну, великий султан.

source: Sultan!
ru: Султан!

source: It' s real luck, my meeting you like this.
ru: Поистине удача, что мы с тобой встретились.

source: I' m asking for the hand of Princess Boudour.
ru: Я прошу отдать мне в жены царевну Будур.

source: - What did he say?
ru: - Что он сказал?

source: - My tongue refuses to repeat it.
ru: - Мой язык отказывается повторить.

source: Your daughter likes me and I like her.
ru: Твоя дочь и я нравимся друг другу!

source: Only she says she won' t marry me without your permission.
ru: Но она не может выйти за меня без твоего позволения.

source: Yes, sire.
ru: Слушаюсь.

source: Our great Sultan asks whether you know, young man, that seventeen princes...
ru: Великий султан спрашивает, а известно ли тебе, юноша, что семнадцать принцев...

source: Eighteen princes!
ru: Восемнадцать!

source: That 19 princes have already come to ask for the fair Boudour' s hand.
ru: Что девятнадцать принцев приезжали свататься к царевне Будур?

source: She did tell me that.
ru: Она мне об этом говорила.

source: Before asking for marriage, you should offer the Sultan presents.
ru: Прежде, чем свататься, надлежит султану преподнести подарки.

source: - You mean rubies and emeralds?
ru: - Рубины и изумруды?

source: - Precisely!
ru: - Именно!

source: Oh, I forgot about that!
ru: Я совсем забыл!

source: I' il have them brought here right away.
ru: Сейчас подарки доставят.

source: Do you have a treasure buried at your house?
ru: У тебя дома зарыт клад?

source: I' ve got no treasure.
ru: Да никакого клада у меня нет!

source: - A Genie.
ru: - Джин.

source: Stay there!
ru: Сиди!

source: Throw him in the dungeon!
ru: В темницу его!

source: Daughter of ours!
ru: Дочь наша!

source: - We' re most displeased.
ru: - Мы разгневаны.

source: - I' m the one who' s displeased!
ru: - Это я разгневана!

source: There' re no princes left.
ru: Ты отказала всем принцам, и принцев уже не осталось.

source: And you did it in order to end up in a beggar' s hut.
ru: И это для того, чтобы попасть в лачугу оборванца.

source: Don' t you dare call him that bad name!
ru: Не называй его плохим словом!

source: - What name should I call him?
ru: - А как же его называть?

source: - Aladdin!
ru: - Аладдин!

source: From now on we shall call by name every beggar and good- for- nothing.
ru: Мы станем называть по имени каждого бездельника и нищего.

source: Who is to shut up?
ru: кому молчать?

source: You will set him free at once and ask for his forgiveness.
ru: Сейчас же отпусти его и попроси у него прощения!

source: Those were your last words.
ru: Это последнее, что ты сказала.

source: We' il have you wedded today.
ru: Сегодня же отдадим тебя замуж.

source: - Try and see what happens.
ru: - Только попробуй.

source: - I' il try.
ru: - Попробую.

source: Well, so!
ru: Ах, так!

source: - Remember it and write it down!
ru: - Запомните и запишите!

source: - Write it down.
ru: - Запишите.

source: We shall give our daughter and half our kingdom to...
ru: Мы отдаем свою дочь и полцарства за...

source: To the very first man to walk through that door.
ru: За того, кто первый войдет в эту дверь.

source: From now on, half our kingdom and our daughter belong to your son.
ru: Отныне полцарства и дочь наша принадлежат твоему сыну.

source: Out of my way!
ru: Прочь!

source: Grab the Princess!
ru: Держи царевну!

source: No one has anything to suggest to us?
ru: Никто не может дать нам должный совет?

source: - There is a way.
ru: - Есть способ.

source: - Speak up.
ru: - Говори.

source: The Princess must be told it was just a dream.
ru: Царевну надлежит убедить, что это был только сон.

source: Since it was but a dream and nothing has happened to her, she will be obedient again.
ru: Раз это был сон и с ней ничего не случилось, она опять станет послушна.

source: And the heart of our great Sultan will rejoice.
ru: И сердце великого султана возрадуется.

source: And what does the Great Wiseman say?
ru: А что скажет наимудрейший?

source: A dream' s not that' s not a dream, and not a dream is not a dream.
ru: Сон не есть не сон, а не сон не есть сон.

source: So to say of not a dream that it' s a dream is the same as to say of a dream that it' s not.
ru: Итак, не про сон сказать, что это сон - все равно, что сказать про сон, что это не сон.

source: We order to say of a dream that it is not one, and of not a dream, that it' s a dream...
ru: Повелеваем про сон сказать, что это не сон, а сон это про не сон...

source: The Princess went nowhere.
ru: Царевна нигде не была.

source: She dreamed it all.
ru: Ей все приснилось.

source: Everybody understood us?
ru: Все поняли нас?

source: Be off with you!
ru: Пошла!

source: I even saw in a dream that I taught crocodiles to read in Persian.
ru: А еще я видел сон, что учу крокодилов читать по- фарситски.

source: I have also dreamed that I was a minaret and that from my top the muezzins were crying.
ru: А еще я видел сон, будто я минарет, а на моей голове кричат муэдзины.

source: I have even dreamed that my hair walked to the bazaar to buy a comb.
ru: А еще я видел сон, что мои волосы ушли на базар покупать гребешок.

source: So you' ve only dreamed about that beggar.
ru: А то, что ты видела того оборванца тоже во сне.

source: lf I dreamed it, how come Mubarak fought with him?
ru: Если это было во сне, как мог Мубарак вцепиться в него?

source: Mubarak!
ru: Мубарак!

source: I' m told that yesterday you fought with some beggar.
ru: Говорят, что ты вчера вцепился в какого- то оборванца!

source: Yesterday I didn' t go any place.
ru: Я вчера нигде не был.

source: I mean I hunted and killed...
ru: Я был на охоте и убил...

source: A lion.
ru: Льва.

source: A lion!
ru: Льва!

source: I remember it very well.
ru: Я же помню.

source: - A goat.
ru: Я была в Багдаде и видела козу. - кого? - козу.

source: It' s true.
ru: Я говорю правду.

source: And Mustafa brought me back to the palace.
ru: Сам Мустафа привел меня во дворец.

source: The last two days I spent in bed with a toothache.
ru: У меня болела челюсть!

source: Our daughter Boudour, we' re not angry with you.
ru: Дочь наша, Будур, мы не разгневаны!

source: Tell me, it did happen, didn' t it?
ru: Скажи, ведь это было?

source: You did scold me about Aladdin!
ru: Ты же ругал меня за Аладдина.

source: I scolded you about Prince Abou Abdul ibn- Abdul...
ru: Я ругал тебя за принца Абу Абдулла ибн Абдулла...

source: - I' ve never heard of Aladdin.
ru: - О каком Аладдине ты говоришь?

source: How can it be?
ru: как же так?.

source: Then I dreamed it.
ru: Значит, я спала.

source: All this was just a dream.
ru: И все это был сон.

source: Tomorrow you' il lose your head.
ru: Завтра ты будешь без головы.

source: Any other news?
ru: Еще какие вести?

source: Do you hear that music?
ru: Слышишь эту музыку?.

source: I' m marrying Princess Boudour!
ru: Я женюсь на царевне Будур!

source: Are you in there?
ru: Ты здесь?

source: I hear and obey.
ru: Слушаю и повинуюсь.

source: Have you no shame?
ru: У тебя совесть есть?

source: Why did you let them throw Aladdin in a dungeon?
ru: Зачем ты позволил схватить Аладдина?

source: All you had to do is to rub the lamp.
ru: Надо было потереть лампу.

source: - Couldn' t you guess it yourself?
ru: - Ты сам не мог догадаться?

source: - It' s not my concern.
ru: - Это не мое дело.

source: I knew it would end badly!
ru: Я знала, этим кончится!

source: Oh, my heart' s joy!
ru: Волосок моего сердца!

source: My little camel!
ru: Мой верблюжонок!

source: Bring Aladdin back!
ru: Неси Аладдина обратно!

source: Take your lamp and your Genie!
ru: Возьми свою лампу и джина!

source: I never want to see them again!
ru: И чтобы я их больше не видела!

source: I' il teach you how to fly on dragons!
ru: Я тебе покажу драконов!

source: I' il teach you how to ask for Princess Boudour' s hand!
ru: Я тебе покажу царевну Будур!

source: I pray that' s not the goat!
ru: Только бы не коза!

source: The lamp will be mine!
ru: Лампа будет моя!

source: Oh, the brightest of all stars!
ru: О, звезда моих очей!

source: He flew away!
ru: Улетел!

source: He' s flown away!
ru: Улетел!

source: - Who has flown away?
ru: - Где Мубарак?. - кто улетел?

source: What is the meaning of this?
ru: Что это означает?

source: Get me down from here!
ru: Снимите меня!

source: What are you doing there?
ru: Что ты там делаешь?

source: Come down!
ru: Слезай!

source: I can' t!
ru: Не могу!

source: How did you climb up there?
ru: Снимите меня! как ты туда забрался?

source: Let him stay up there!
ru: Не снимайте его!

source: Jump!
ru: Прыгай!

source: I' m stuck!
ru: Не могу!

source: - Why did you climb up there?
ru: - Зачем ты туда забрался?

source: - I didn' t climb up there.
ru: - Я не забирался.

source: Everybody saw you up there!
ru: Все видели, что ты там сидел!

source: Since you climbed up there, you might as well say so.
ru: Раз забрался, скажи, что забрался.

source: Oh great Sultan, pardon this foolish child!
ru: Прости, великий султан, неразумное дитя!

source: It is only because he' s young and has too much passion.
ru: Это он по молодости и излишнему усердию.

source: We' il leave them once more.
ru: Оставим их еще раз.

source: - What if he flies away again?
ru: - А вдруг он опять улетит?

source: - Just let him try to.
ru: - Пусть только попробует.

source: Oh, heavenly one...
ru: О, звезда...

source: Oh, the brightest of all...... stars!
ru: О, звезда моих...... очей!

source: Good night, Boudour!
ru: Будур, спокойной ночи!

source: I' m the son of the Grand Vizier!
ru: Я сын главного везиря!

source: What a clever Genie!
ru: какой хитрый джин.

source: What would the son of a vizier be doing in a jar?
ru: Зачем сыну везиря забираться в горшок?.

source: Make way for the Great Sultan!
ru: Дорогу великому султану!

source: So, whoever is stuffed in the jar claims to be my son!
ru: Итак, сидящий в горшке утверждает, что он мой сын!

source: Who is in there?
ru: кто там?

source: Mubarak! ls that you?
ru: Это ты?

source: - Get them all out of here!
ru: - Разогнать всех!

source: - Get them out!
ru: - Разогнать!

source: - Why did you get in the jar?
ru: - Зачем ты залез в горшок?.

source: - I didn' t.
ru: - Я не залезал.

source: Lousy liar!
ru: Подлый лжец.

source: Everyone saw you in thatjar.
ru: Все видели, ты там сидел!

source: Why did you stuff yourself in there?
ru: Зачем ты залез в горшок?.

source: Whether or not he got in there no longer interests us.
ru: Залез он или нет, это нас уже не интересует.

source: lf he prefers stuffing jars to half my kingdom and my daughter, just let him stuff them.
ru: Если ему больше нравится горшок, чем полцарства и рука моей дочери, пусть лазит по горшкам.

source: Announce it to all of Bagdad!
ru: Да возвестят в Багдаде!

source: From this moment on, the son of the Vizier and Princess Boudour are no longer husband and wife!
ru: Отныне сын везиря и царевна Будур больше не муж и жена!
